app/controllers/account_management/company_controller.rb

	def index
		if current_user.has_access 17
			@search = Company.search(params[:search])
			@list_companies = @search.where(:deleted => 0).paginate(:page => params[:page]).order('id DESC')
			@list_users = User.where(:deleted=>0)
---
SELECT `companies`.* FROM `companies`
SELECT COUNT(*) FROM `companies` WHERE `companies`.`deleted` = 0
SELECT `companies`.* FROM `companies` WHERE `companies`.`deleted` = 0 ORDER BY id DESC LIMIT 30 OFFSET 0
SELECT `users`.* FROM `users` WHERE `users`.`deleted` = 0

	def show
		if current_user.has_access 19
      @company = Company.find(params[:id])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1

	def edit
		if current_user.has_access 20
      @company = Company.find(params[:id])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1