app/controllers/account_management/log_controller.rb

SELECT COUNT(*) FROM `logs`
---
  def index
    if current_user.has_access 12
      @search = Log.search(params[:search])
      @list_logs = @search.paginate(:page => params[:page]).order('id DESC')