app/controllers/account_management/profile_controller.rb

SELECT `profiles`.* FROM `profiles`
SELECT COUNT(*) FROM `profiles` WHERE `profiles`.`deleted` = 0
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`deleted` = 0 ORDER BY id DESC LIMIT 10 OFFSET 0
---
  def index
    if current_user.has_access 7
      @search = Profile.search(params[:search])
      @list_profiles = @search.where(:deleted => 0).paginate(:page => params[:page]).order('id DESC')

SELECT `access_profiles`.* FROM `access_profiles` WHERE ((`access_profiles`.`profile_id` = 0 AND `access_profiles`.`deleted` = 0))
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
SELECT `accesses`.* FROM `accesses` WHERE `accesses`.`parent_id` = 1 LIMIT 1
---
  def new
    if current_user.has_access 8
      @profile = Profile.new
      @list_profile_access = AccessProfile.find :all, :conditions => {:profile_id => 0, :deleted=>0}
      @list_parent_access = Access.where(:parent_id => 0)