app/controllers/account_management/user_controller.rb

  def index
    @current_view = "security"
    if current_user.has_access 2
      @search = User.search(params[:search])
      @list_users = @search.where(:deleted => 0).paginate(:page => params[:page]).order('id DESC')
      @list_profiles = Profile.where(:deleted => 0)
---
SELECT `users`.* FROM `users`
SELECT COUNT(*) FROM `users` WHERE `users`.`deleted` = 0
SELECT `users`.* FROM `users` WHERE `users`.`deleted` = 0 ORDER BY id DESC LIMIT 10 OFFSET 0
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`deleted` = 0

  def new
    if current_user.has_access 3
      @user = User.new
      @list_profiles = Profile.where(:deleted => 0)
---
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`deleted` = 0

  def show
    if current_user.has_access 4
      @user = User.find params[:id]
      @list_profiles = Profile.where(:id => @user.profile.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1

  def edit
    if current_user.has_access 5
      @user = User.find params[:id]
      @list_profiles = Profile.where(:deleted => 0)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`deleted` = 0

  def dashboard
    @current_view = "dashboard"
    if current_user.profile_id == 1

    end
    if current_user.profile_id == 2
      @subscription = Panel::Subscription.where(:User_id=>current_user.id).first
      one_day_in_seconds = 86400
      @days_left = ( ( @subscription.expired_at - Time.now  ) / one_day_in_seconds ).round
      @surveys=Match.where(:match_type_id => 1, :deleted=>0 , :user_id => current_user.id).order('updated_at DESC')
---
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
SELECT `matches`.* FROM `matches` WHERE ((`matches`.`match_type_id` = 1 AND `matches`.`deleted` = 0)) ORDER BY updated_at DESC