app/views/account_management/user/dashboard.html.erb

SELECT `accesses`.* FROM `accesses` WHERE (parent_id = 0) ORDER BY order1 DESC
---
<%if current_user.profile_id==1%>
	<% list_access = Access.find(:all, :conditions => ['parent_id = ?', 0])%>