app/views/account_management/profile/_edit_access_childs.html.erb

<%list_access = Access.find_all_by_parent_id access_parent_id%>
---
SELECT `accesses`.* FROM `accesses` WHERE `accesses`.`parent_id` = 1 LIMIT 1