app/views/layouts/_sidebar.html.erb

SELECT `accesses`.* FROM `accesses` WHERE (parent_id = 0) ORDER BY order1 DESC
---
<% list_access = Access.find(:all, :conditions => ['parent_id = ?', 0])%>